# a = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
# b = len(a)
# print(b)
# c = [2, -93, -2, 8, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
# d = sum(c)
# r = d//19
# a[4] = -17
# print(a)

# a = ["Маша", "Петя", "Саша", "Оля", "Кирилл", "Коля"]
# print( a [ : 3 ])
# print( a [3: ])

# a = ["Письмо 1", "Письмо 2", "Письмо 3", "Письмо 4", "Письмо 5"]
# a.reverse()
# print(a)

# e = ["Письмо 1", "Письмо 2", "Письмо 3", "Письмо 4", "Письмо 5"]
# e[2]
# e[3]
# print(e[2])
# print(e[3])

# a = [10, 8, 9, 7, 6, 9, 10, 8, 9, 10]
# b = sum(a)
# c = len(a)
# d = b//c
# print(d)
# v = min(a)
# f = max(a)
# print(v)
# print(f)

# a = ["яблоко", "банан", "опельсин", "виноград"]
# a[2] = 'апельсин'
# print(a)

