a = 1 # целое число
a = 1.0 # вещественное число
a = 1 + 1j # комплексное число
a = True # булевое значение
a = None # пустой тип
a = 'hello' # строка
a = [1,1.0, 'hello'] # список
a = (1, 1.0, 'hello') # кортеж
a = {1, 1.0,'hello'} #  множество
a = frozenset({1, 1.0 'hello'}) # неизменяемое множество
a = {'a': 1, 'b': 2} # словарь
a = b'hello' # байтовый тип
a = bytearray(b'hello')
a = [1, 1.0, 'hello'] # создаем список
help(a) # выводим информацию об 'a'
print(a) # ыводим значение 'а' в консоль
b = input('Веди число') # в консоль выводится сообщение и ожидается когда пользователь введет числло
len(a) # сколько обьектов в 'а'
min(a) # минимальное значение в 'а'
max(a) # максимальное значение в  'а'
type(a) # тип обьекта  'а'
a = 1
a = 'новое значение переменной a'
some_var :int = 1
other_var :str = 'Hello World'
some_var = 1
other_var = 'Hello World'
5 + 1.1 # 6.1
5 +'str' # Ошибка